//Назначение: 
/**
 * Заполняет дату оповещения клиента о длительном ожидании
* @param DAYS_TO_NOTIFY - число календарных дней, по истечении
* которых, контрагенту уйдёт оповещение.
*/
//Версия: 4.6.0+
//Категория: действие на вход в статус
//Параметры-----------------------------------------------------
def root = utils.get('root',[:])
def DAYS_ATTR ='NScWDays'
def DAYS_TO_NOTIFY = root[DAYS_ATTR]
//Функции-------------------------------------------------------
//Основной блок ------------------------------------------------
if(DAYS_TO_NOTIFY && DAYS_TO_NOTIFY>0){
  def newDate = new Date() + (int)DAYS_TO_NOTIFY 
  utils.edit(subject, ['waitingTime' : newDate])
}
