/*! UTF8 */
//Автор: dpodkhvatilin
//Дата создания: 26.08.20
//Назначение:
/**
 * Копирует последний комментарий в заявке в атрибут "Последний комментарий",
 * заполняет атрибут "Дата последнего комментария"
 */
//Версия: 4.11.0+
//Категория: Скрипт действия по событию
//Параметры------------------------------------------------------
//Функции--------------------------------------------------------
//Основной блок -------------------------------------------------
def cmmnt = sourceObject
def authorName = (cmmnt.author) ? cmmnt.author.toString() : 'Суперпользователь'
def com = "<b>${authorName}:</b><br/>${cmmnt.text}"
if(cmmnt.private) {
  com = "<div style='color: #666666'>${com}</div>"
}
utils.edit(subject, ['lastComment' : com, 'commentDate' : new Date()])