//Автор: dshirykalov
//Дата создания: 05.03.2014
//Назначение:
/**
*  Скрипт присваивает значениям атрибута типа Элемент справочника целочисленные значения и создает объект класса "Оценка"
*/
//Версия: 4.2.0.0 
//Категория: Действия по событию
// ПАРАМЕТРЫ ----------------------------------------------------------
param1 = "myMarkNew" // Код атрибута "Оцените статью" класса "База знаний"
param2 = "1" // Код элемента справочника с оценкой "1"
param3 = "2" // Код элемента справочника с оценкой "2"
param4 = "3" // Код элемента справочника с оценкой "3"
param5 = "4" // Код элемента справочника с оценкой "4"
param6 = "5" // Код элемента справочника с оценкой "5"
param7 = "markBase" // Код класса "Оценка"
param8 = "markBase" // Код типа "Оценка" класса "Оценка"
param9 = "value" // Код атрибута "Поставленная оценка" класса "Оценка"
//ОСНОВНОЙ БЛОК--------------------------------------------------------
def value
if (subject.myMarkNew.code== '1')
{
 value = 1
}
else if (subject.myMarkNew.code== '2')
{
 value = 2
}
else if (subject.myMarkNew.code== '3')
{
 value = 3
}
else if (subject.myMarkNew.code== '4')
{
 value = 4
}
else if (subject.myMarkNew.code== '5')
{
 value = 5
}
utils.create('markBase$markBase', ['parent': subject, 'title': 'Оценка', 'author':user, 'value': value])
utils.edit(subject, ['myMarkNew': null])